app/admin/dashboard.rb

SELECT "companies".* FROM "companies"
SELECT "negociators".* FROM "negociators" WHERE "negociators"."company_id" = $1  [["company_id", 1]]
---
    columns do
      panel "Agences" do
        ul do
          Company.all.map do |post|
            li post.company_name
            ul "negociateur :" do
              post.negociators.map do |negociator|

SELECT "properties".* FROM "properties"
---
              end
            end
            ul "Bien :" do
              post.properties.map do |property|