app/views/companies/edit.html.erb

SELECT "negociators".* FROM "negociators"
---
                  <div class="form-group">
                    <%= f.collection_select :negociators_id, Negociator.all, :id, :first_name, { selected: @company.negociators_id }, { class: 'form-control chosen-select' } %>