app/controllers/companies_controller.rb

  def index
    @company = Company.where(id: current_company.id)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-07-02 14:37:48.744089"], ["updated_at", "2018-07-02 14:37:48.744089"]]

  def destroy
    Property.where(company_id: @company.id).destroy_all
    Negociator.where(company_id: @company.id).destroy_all
    @company.destroy
---
DELETE FROM "companies" WHERE "companies"."id" = $1  [["id", 1]]
DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 1]]
SELECT "properties".* FROM "properties" WHERE "properties"."company_id" = $1  [["company_id", 1]]
DELETE FROM "negociators" WHERE "negociators"."id" = $1  [["id", 1]]
SELECT "negociators".* FROM "negociators" WHERE "negociators"."company_id" = $1  [["company_id", 1]]

    def set_company
      @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]