app/controllers/negociators_controller.rb

  def create
    @negociator = Negociator.new(negociator_params)

    respond_to do |format|
      if @negociator.save
---
INSERT INTO "negociators" ("first_name", "last_name", "companies_id") VALUES ($1, $2, $3) RETURNING "id"  [["first_name", "Patrick"], ["last_name", "Snitchy"], ["companies_id", 1]]

  def update
    respond_to do |format|
      if @negociator.update(negociator_params)
---
UPDATE "negociators" SET "last_name" = $1 WHERE "negociators"."id" = $2  [["last_name", "pezzeze"], ["id", 7]]

  def destroy
    Property.where(negociator_id: @negociator.id).destroy_all
    @negociator.destroy
---
DELETE FROM "negociators" WHERE "negociators"."id" = $1  [["id", 1]]
DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 1]]
SELECT "properties".* FROM "properties" WHERE "properties"."negociator_id" = $1  [["negociator_id", 1]]
DELETE FROM "negociators" WHERE "negociators"."id" = $1  [["id", 2]]

    def set_negociator
      @negociator = Negociator.find(params[:id])
---
SELECT  "negociators".* FROM "negociators" WHERE "negociators"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def check_authorization
      company = Company.find_by_id(params[:company_id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]