app/controllers/negociators_controller.rb

SELECT "negociators".* FROM "negociators"
---
  def index
    @negociators = Negociator.all