app/controllers/negociators_controller.rb

SELECT "negociators".* FROM "negociators" WHERE "negociators"."companies_id" = $1  [["companies_id", 1]]
---
  def index
    @negociators = Negociator.where(companies_id: params[:company_id])