app/controllers/properties_controller.rb

  def index
    @properties = Property.where(company: current_company.id)
---
SELECT "properties".* FROM "properties" WHERE "properties"."company_id" = $1  [["company_id", 1]]

  def new
    @property = Property.new
    @negociator = Negociator.where(company_id: current_company.id)
---
SELECT "negociators".* FROM "negociators" WHERE "negociators"."company_id" = $1  [["company_id", 1]]