app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties" WHERE "properties"."companies_id" = $1  [["companies_id", 1]]
---
  def index
    @properties = Property.where(companies_id: current_company.id)

SELECT "negociators".* FROM "negociators" WHERE "negociators"."companies_id" = $1  [["companies_id", 1]]
---
  def new
    @property = Property.new
    @negociator = Negociator.where(companies_id: current_company.id)

SELECT "negociators".* FROM "negociators" WHERE "negociators"."companies_id" = $1  [["companies_id", 1]]
---
  def edit
    @negociator = Negociator.where(companies_id: current_company.id)

INSERT INTO "properties" ("property_type", "property_nbr", "property_date", "mandat_type", "mandat_date", "compromis_date", "address", "price", "negociators_id", "companies_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @property = Property.new(property_params)

    respond_to do |format|
      if @property.save

DELETE FROM "properties" WHERE "properties"."id" = $1  [["id", 2]]
---
  def destroy
    @property.destroy

SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_property
      @property = Property.find(params[:id])

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def check_authorization
      company = Company.find_by_id(params[:company_id])